class module_task1:
    def task1(num):
        print("Тема: 1. ЗНАЙДІТЬ ПРАВИЛЬНУ ВІДПОВІДЬ:")

        questions = {
            "З якого боку від коми розміщені позиції цифр, які мають вагу, що дорівнює числу 10 в додатній степені?" : "а) праворуч;",
            "Що прийнято називати основою системи числення:" : "б) кількість символів, що використовується в системі числення;",
            "Яку дію потрібно виконати для визначення “ваги” даного розряду числа до загальної його величини?" : "в) перемножити номер розряду і значення цифри, яка в ньому знаходиться;",
            "Що є основою двійкової системи числення?" : "е) 10[2];",
            "Яке з двох чисел більше: 11112 або 1110?" : "Якщо в умові немає помилки, то звісно ж 11112.",
            "Яку операцію необхідно виконати при перетворенні цілої частини числа з однєї системи числення до іншої?" : "г) ділення;",
            "Яку операцію необхідно виконати при перетворенні дробової частини числа з однєї системи числення до іншої?" : "в) множення;",
            "До якої кількості символів скорочується двійковий запис байта при використанні вісімкових символів?" : "б) 3;",
            "До якої кількості символів скорочується двійковий запис двобайтового числа при використанні шістнадцяткових символів?" : "г) 4;",
            "У скільки разів зменшується довжина запису чисел при переході від двійкової системи представлення до шістнадцяткової?" : "в) 4;",
            "Звідки починається розбиття на тріади двійкового числа при його переведенні до вісімкової системи?" : "б) від молодшого вагового розряду;",
            "Чим відрізняються двійкові числа 1012; 01012 і 0000 01012? Як це може вплинути на результат двійкового сумування?" : "в) числа рівні;",
            "Яка максимальна кількість розрядів необхідна для представлення результату додавання двох 8-розрядних чисел?" : "а) 9;",
            "Які символи використовуються у вісімковій системі числення?" : "г) 0 : 7",
            "Яку кількість різних десяткових чисел можна представити 8-розрядним двійковим числом?" : "б) 256;",
            "Які символи використовуються у шістнадцятковій системі числення?" : "г) 0 : F;",
            "Які символи використовуються у двійковій системі числення?" : "в) 0 : 1;",
            "Яка максимальна кількість розрядів необхідна для представлення результату додавання двох 10-розрядних чисел?" : "б) 11;",
            "Яке мнемонічне позначення має команда арифметичного додавання у навчальній програмі DeComp?" : "г) ADD;",
            "Яке мнемонічне позначення має команда арифметичного віднімання у навчальній програмі DeComp?" : "в) SUB;",
            "Сигнали, які відображають обмежену кількість фіксованих станів об’єкта чи процесу і на скінченному інтервалі параметрів набувають обмеженої кількості їхніх значень називають:" : "б) дискретними;",
            "Скінчена множина символів, за допомогою якої подається інформація про певний об’єкт, називається;" : "в) алфавіт;",
            "Впорядкована послідовність скінченої кількості символів, називається:" : "г) слово;",
            "Універсальний спосіб відображення дискретної інформації під час її зберігання, передавання та опрацювання у вигляді системи відповідностей між елементами повідомлень" : "а) код;",
            "Матеріальний носій інформації, який має певні фізичні властивості, називається;" : "б) сигнал;",
            "Інформація, яка подана у формалізованому вигляді, для інформаційних технологій, як правило, за допомогою букв, цифр чи певних символів." : "а) дані;",
            "Дані, які передаються джерелом інформації або ті, що отримані приймачем, називаються:" : "в) повідомлення;",
            "Логічна операція «АБО» позначається як:" : "а) OR;",
            "Логічна операція «І» позначається як:" : "б) AND;",
            "Логічна операція «ЗАПЕРЕЧЕННЯ» позначається як:" : "г) NOT;"
        }

        print("Питання: " + num)
        print("Відповідь: " + questions[num])
        print("\n\n")